{"name": "Красивая таблица результатов", "text": "Красивая таблица результатов\nОлег - известный поклонник соревнований по программированию. Он знает всех участников всех соревнований за последние десять лет и может про любого участника сказать, сколько задач решила команда с его участием на любом соревновании. И еще Олег очень любит теорию чисел.\nВ таблице результатов соревнования по программированию команды упорядочены по убыванию количества решенных задач. Олег называет таблицу результатов красивой, если для всех команд количество решенных ими задач равно нулю или является делителем количества задач на соревновании. Когда какая-нибудь команда сдает задачу, количество сданных задач у нее увеличивается на один. Никакая команда не может сдать две или более задач одновременно, также две команды не могут одновременно сдать задачу.\nГлядя на красивую таблицу результатов, Олег заинтересовался: а сколько еще задач смогут суммарно сдать команды так, чтобы после каждой сданной задачи таблица результатов оставалась красивой? Помогите ему выяснить это.\nВходные данные\nПервая строка входного файла содержит два целых числа: n и m - количество команд и количество задач на соревновании, соответственно (1≤n≤100, 1≤m≤109). Вторая строка содержит n целых чисел, упорядоченных по невозрастанию: для каждой команды задано, сколько задач она решила. Гарантируется, что все отличные от нуля числа являются делителями числа m.\nВыходные данные\nВыведите в выходной файл одно число: максимальное количество задач, которое суммарно могут еще сдать команды так, чтобы после каждой сданной задачи таблица результатов оставалась красивой.", "compiler": "Judge C++", "send_date": "13 мая 2016 г., 13:52:27", "time": 5.22, "memory": 692, "code": "#include <iostream>\n#include <cmath>\nusing namespace std;\nint main()\n{\n\n    int n, m;\n    cin >> n >> m;\n    int a[n];\n    int i;\n    int sq = sqrt(m);\n    for(i = 1; i <=n;i++)\n        cin >> a[i];\n    int k = -1;\n    int y, yi;\n    int ki = -1;\n    int sum = 0;\nfor(i = 1; i <= n; i++)\n{\n   while(m % (a[i]+1)==0)\n   {\n       a[i]++;\n       sum++;\n   }\n}\n    cout << sum << endl;\n}", "link": "https://www.e-olymp.com/ru/problems/605"}