{"name": "Кондиціонер Степана", "text": "Кондиціонер Степана\nВ офісі, де Степан працює програмістом, встановили кондиціонер нового типу. Цей кондиціонер відрізняється особливою простотою в управлінні. У кондиціонера є всього лише два керованих параметра: бажана температура і режим роботи.\nКондиціонер може працювати в наступних чотирьох режимах:\n- «freeze» - охолодження. У цьому режимі кондиціонер може тільки зменшувати температуру. Якщо температура в кімнаті і так не більше бажаної, то він вимикається.\n- «heat» - нагрів. У цьому режимі кондиціонер може тільки збільшувати температуру. Якщо температура в кімнаті і так не менше бажаної, то він вимикається.\n- «auto» - автоматичний режим. У цьому режимі кондиціонер може як збільшувати, так і зменшувати температуру в кімнаті до бажаної.\n- «fan» - вентиляція. У цьому режимі кондиціонер здійснює тільки вентиляцію повітря і не змінює температуру в кімнаті.\nКондиціонер досить потужний, тому при налаштуванні на правильний режим роботи він за годину доводить температуру в кімнаті до бажаної.\nПотрібно написати програму, яка по заданій температурі в кімнаті troom, встановленим на кондиціонері бажаної температурі tcond і режиму роботи визначає температуру, яка встановиться в кімнаті через годину.\nФормат вхідних даних: Перший рядок вхідного файлу містить два цілих числа troom, і tcond, розділених рівно одним пропуском (-50 ≤ troom ≤ 50 , -50 ≤ tcond ≤ 50).\nДругий рядок містить одне слово, записане малими літерами латинського алфавіту - режим роботи кондиціонера.\nФормат вихідних даних: Вихідний файл повинен містити одне ціле число - температуру, яка встановиться в кімнаті через годину.\nПояснення до прикладів:\nУ першому прикладі кондиціонер знаходиться в режимі нагріву. Через годину він нагріє кімнату до бажаної температури в 20 градусів.\nУ другому прикладі кондиціонер знаходиться в режимі охолодження. Оскільки температура в кімнаті нижча, ніж бажана, кондиціонер самостійно вимикається і температура в кімнаті не поміняється.", "compiler": "Judge C++", "send_date": "17 янв. 2017 г., 19:48:04", "time": 4.23, "memory": 676, "code": "#include <bits/stdc++.h>\nusing namespace std;\nint main()\n{\n    int Troom, Tcond;\n    cin >> Troom >> Tcond;\n    string s;\n    cin >> s;\n    int Tr = Troom,Tc = Tcond;\n    if(s == \"heat\")\n    {\n        Tc -= Tr;\n        if(Tc >= 0)\n            cout << Tcond << endl;\n            else\n        cout << Troom << endl;\n        return 0;\n    }\n    if(s == \"freeze\")\n    {\n        Tr -= Tc;\n        if(Tr > -1)\n            cout << Tcond << endl;\n        else\n            cout << Troom << endl;\n\n        return 0;\n    }\n    if(s == \"auto\")\n    {\n        cout << Tc << endl;\n        return 0;\n    }\n    if(s == \"fan\")\n    {\n        cout << Tr << endl;\n        return 0;\n    }\n}", "link": "https://www.e-olymp.com/ru/problems/7234"}