{"name": "Изменение доски", "text": "Изменение доски\nМаленький Дима подарил своему младшему брату Пете интерактивную шахматную доску размером n * m. Она обладает многими удивительными особенностями, но одна из них Петина любимая. Он может выбрать любой прямоугольник, образованный квадратами доски и выполнить его инверсию. Каждая белая клетка в перевернутом прямоугольнике становится черным, а каждый черный становится белым.\nВ исходном состоянии доска окрашена в шахматном стиле, а именно: каждая клетка является черной или белой, причем каждые две клетки, имеющие общую сторону, имеют разные цвета. Маленький Петя хочет выполнить несколько инверсий, описанных выше, чтобы преобразовать все клетки в один цвет. Он нетерпелив, поэтому просит Вас предоставить ему инструкции как это сделать с минимальным количеством инверсий.\nВходные данные\nСодержит два целых числа n и m (1 ≤ n, m ≤ 50) - соответственно количество строк и столбцов на доске.\nВыходные данные\nВ первой строке вывести наименьшее количество инверсий k, необходимых для преобразования доски.\nСледующие k строк описывают инверсии, по одной в строке. Каждая строка должна содержать 4 целых чисел - номера строки и столбца одного угла прямоугольника, а также номера строки и столбца противоположного угла прямоугольника. Любые два противоположные угла могут задавать прямоугольник.\nСтроки доски пронумерованы от 1 до n. Столбцы доски пронумерованы от 1 до m.", "compiler": "Judge C++", "send_date": "20 июн. 2017 г., 15:24:21", "time": 2.33, "memory": 1800, "code": "#include <bits/stdc++.h>\n#include <string>\nusing namespace std;\nstring iTostring(int a){\n    string s = \"\";\n    while(a > 0)\n    {\n        s += ((a%10)+'0');\n        a/=10;\n    }\n    string ans=\"\";\n    for(int i = s.length()-1;i>=0;i--)\n        ans+=s[i];\n    return ans;\n}\nint main(){\n    int n,m, c=0;\n    string s = \"\";\n    cin >> n >> m;\n    for(int i = 2; i <= m; i+=2){\n        string w = iTostring(i);\n        string f = iTostring(n);\n        s += \"1 \" + w + \" \" + f + \" \" + w + \"\\n\";\n        c++;\n    }\n    for(int i = 2; i<=n;i+=2){\n        string w = iTostring(i);\n        string f = iTostring(m);\n        s += \"\" + w + \" 1 \" + w + \" \" + f  + \"\\n\";\n        c++;\n    }\n    cout << c << endl << s;\n}", "link": "https://www.e-olymp.com/ru/problems/7624"}