{"name": "Клавиатура", "text": "Клавиатура\nВсем известно, что со временем клавиатура изнашивается, и клавиши на ней начинают залипать. Конечно, некоторое время такую клавиатуру еще можно использовать, но для нажатий клавиш приходиться использовать большую силу.\nПри изготовлении клавиатуры изначально для каждой клавиши задается количество нажатий, которое она должна выдерживать. Если знать эти величины для используемой клавиатуры, то для определенной последовательности нажатых клавиш можно определить, какие клавиши в процессе их использования сломаются, а какие – нет.\nТребуется написать программу, определяющую, какие клавиши сломаются в процессе заданного варианта эксплуатации клавиатуры.\nВходные данные\nПервая строка содержит количество клавиш n (1 ≤ n ≤ 100) на клавиатуре. Вторая строка содержит n целых чисел - с1, с2, … , сn, где сi (1 ≤ сi ≤ 100000) – количество нажатий, выдерживаемых i-ой клавишей. Третья строка содержит целое число k (1 ≤ k ≤ 100000) – общее количество нажатий клавиш, и последняя строка содержит k целых чисел pj (1 ≤ pj ≤ n) – последовательность нажатых клавиш.\nВыходные данные\nВывести n строк, содержащих информацию об исправности клавиш. Если i-ая клавиша сломалась, то i-ая строка должна содержать слово \"yes\" (без кавычек), если же клавиша работоспособна – слово \"no\".", "compiler": "Judge C++", "send_date": "5 апр. 2017 г., 8:47:41", "time": 19.71, "memory": 1788, "code": "#include <bits/stdc++.h>\nusing namespace std;\nint main()\n{\n    int n,m;\n    cin >> n;\n    vector < pair<int,int> > p(n);\n    int i;\n    int a;\n    for(i = 0; i < n; i++)\n    {\n        cin >> a;\n        p[i].first = 0;\n        p[i].second = a;\n    }\n    cin >> m;\n    for(i = 0; i < m; i++)\n    {\n        cin >> a;\n        p[a-1].first++;\n    }\n    for(i = 0; i < n; i++)\n    {\n        if(p[i].first > p[i].second)\n            cout << \"yes\" << endl;\n        else\n            cout << \"no\" << endl;\n    }\n}", "link": "https://www.e-olymp.com/ru/problems/462"}