{"name": "Наследство короля", "text": "Наследство короля\nВ одной далёкой прямоугольной стране правил мудрый король. И было у него k сыновей. Перед своей смертью он завещал территорию своей страны сыновьям. Правитель рассудил, кто из сыновей мудрее, и исходя из этого завещал каждому сыну землю определённой площади.\nВся прямоугольная территория страны имеет размеры n × m километров и поделена на квадратные регионы размером 1 × 1 километров. Каждый сын может получить в наследство только целое количество регионов. Также каждый сын хочет получить во владение связный участок земли (то есть чтобы из любой его точки можно было дойти до любой другой, переходя только из региона в смежеый с ним. Регионы считаются смежными, если у них есть общая сторона).\nПомогите сыновьям разделить территорию страны в сответствии с завещанием короля.\nВходные данные\nВ первой строке записано три натуральных числа n, m и k (1 ≤ n, m ≤ 700, 1 ≤ k ≤ 10000) - размеры страны и количество сыновей соответственно.\nВо второй строке записано k натуральных чисел a1, a2, ..., aK, где ai - площадь, которую мудрый король завещал i-ому сыну. Гарантируется, что a1 + a2 + ...+ ak = n * m.\nВыходные данные\nВыведите n строк по m чисел в каждой. В строке с номером i в столбце с номером j должен стоять номер сына, которому достанется этот регион (число от 1 до k).", "compiler": "Judge C++", "send_date": "19 июн. 2017 г., 14:33:21", "time": 61.66, "memory": 3188, "code": "#include <bits/stdc++.h>\nusing namespace std;\nint main(){\n    int n,m,k,c=1,p = 0,q=0;\n    cin >> n >> m >> k;\n    vector <int> d(k);\n    int ans[n][m];\n    for(int i = 0; i < k;i++)\n        cin >> d[i];\n    for(int i = 0; i < n; i++)\n    {\n        if(i % 2 == 0){\n        for(int j = 0; j < m; j++)\n        {\n            p++;\n            ans[i][j] = c;\n            if(p >= d[q])\n            {\n                q++;\n                c++;\n                p = 0;\n            }\n        }\n        }\n        else{\n        for(int j = m-1; j >= 0; j--)\n        {\n            p++;\n            ans[i][j] = c;\n            if(p >= d[q])\n            {\n                q++;\n                c++;\n                p = 0;\n            }\n        }\n        }\n    }\n    for(int i = 0; i < n; i++){\n        for(int j = 0; j < m; j++){\n            cout << ans[i][j] << \" \";\n        }\n    cout << endl;\n    }\n}", "link": "https://www.e-olymp.com/ru/problems/5109"}