{"name": "Арифметика Балу", "text": "Арифметика Балу\nБалу, ленивый бурый медведь, который обучает волчат Закону Джунглей. Он может бродить, где ему вздумается, потому что ест одни только орехи, мед и коренья.\nЭто случилось в то время, когда медведь Балу обучал Маугли Закону Джунглей. Большой и важный бурый медведь радовался способностям ученика, потому что волчата обычно выучивают из Закона Джунглей только то, что нужно их Стае и племени. Но Маугли, как детенышу человека, нужно было знать гораздо больше.\nНа занятиях по арифметике Балу придумал следующую игру. Надо было из числа 1 получить число n, при этом разрешалось текущее число либо умножить на 3, либо к текущему числу прибавить 4. За каждое умножение Балу давал 5 тумаков, а за каждое сложение 2 тумака. Например,\nв первом случае получишь 10 тумаков, во втором 12.\nМаугли естественно лучше всех освоил арифметику и быстро придумал, как решить задачу, получив наименьшее количество тумаков. Он также заметил, что не всегда можно выполнить задание хитрого медведя…\nВходные данные\nОдно целое число n (1 ≤ n ≤ 109).\nВыходные данные\nВывести минимальное количество тумаков, которые можно получить за решение задачи. Если решить задачу невозможно, то вывести число 0.", "compiler": "Judge C++", "send_date": "1 июл. 2019 г., 17:04:04", "time": 11.09, "memory": 9064, "code": "#include <bits/stdc++.h>\nusing namespace std;\n#define int unsigned long long\n#define N 1000000\nmap<int, int> m;\nint arr[N];\nint func(int n) {\n    if(n < N)\n        return arr[n];\n    if(m[n] > 0)\n        return m[n];\n    if(n % 3 == 0)\n        return m[n] = func(n/3) + 5;\n    return m[n] = func(n - 4) + 2;\n}\nmain() {\n    int n, a, b;\n    cin >> n;\n    arr[0] = -N;\n    arr[1] = 0;\n    arr[2] = -N;\n    arr[3] = 5;\n    arr[4] = -N;\n    arr[5] = 2;\n    arr[6] = -N;\n    arr[7] = 7;\n    arr[8] = -N;\n    for(int i = 9; i <= N; i++) {\n        if(i % 3 == 0)\n            arr[i] = min(arr[i / 3] + 5, arr[i - 4] + 2);\n        else\n            arr[i] = arr[i - 4] + 2;\n    }\n    int result = func(n);\n    if(result > 1e12 || result < 0)\n        result = 0;\n    cout << result << endl;\n\n}", "link": "https://www.e-olymp.com/ru/problems/1403"}