{"name": "Кто получит \"автомат\"?", "text": "Кто получит \"автомат\"?\nВ Алтайском государственном техническом университете студенты получают оценки по стобальной шкале, то есть от нуля до ста. Преподаватель Павел Иванович пообещал студентам, что те из них, у кого семестровый рейтинг будет выше среднего по группе, получит \"автомат\". А староста группы Петька Петров еще пообещал каждому \"автоматчику\" по шоколадке (у Петьки папа занимается поставками шоколада в магазины, и Петька с ним договорился о спонсорской помощи).\nИ теперь у Пети проблема - ему нужно выяснить, сколько шоколадок он должен принести в университет. Помогите ему в добром начинании. Представляете, как хорошо будет, если каждый предприниматель будет помогать успевающим студентам!\nНапишите программу, которая будет вычислять количество \"автоматов\" в группе студентов. Очень может быть, что Ваша программа пригодится не только для Пети и его отца, а и для предпринимателей всей страны, точнее, для всех умных людей, которые понимают, что надо поддерживать успешных студентов!\nВходные данные\nПервая строка содержит количество студентов n (n ≤ 10000) в группе. Будем считать, что почин Петиного отца будет взят на вооружение всем прогрессивным человечеством, предприниматели будут сражаться за право дать приз студентам не только одной группы, но и всего университета, поэтому число студентов велико.\nСледующие строки содержат n целых чисел - рейтинги студентов. Числа разделены пробелами и, может быть, символами перевода строки.\nВыходные данные\nВыведите количество шоколадок, которое Петя должен принести в университет.", "compiler": "Judge C++", "send_date": "13 мая 2016 г., 9:14:16", "time": 7.21, "memory": 692, "code": "#include <iostream>\n#include <iomanip>\nusing namespace std;\nint main()\n{\n   int n;\n   cin >> n;\n   int a[10000];\n   int sum = 0;\n   int i;\n   double av;\n   for(i = 0; i < n; i++)\n   {\n       cin >> a[i];\n       sum += a[i];\n   }\n   int k = 0;\n   av = sum / i;\n   for(i = 0; i < n; i++)\n   {\n       if(a[i] > av)\n       {\n          k++;\n       }\n   }\n   cout << k << endl;\n    return 0;\n\n}", "link": "https://www.e-olymp.com/ru/problems/2238"}