{"name": "\"Поле чудес\"", "text": "\"Поле чудес\"\nСтепан пройшов до суперфіналу новорічного шоу \"Поле чудес\". На відміну від звичайних ігор новорічна відрізняється тим, що проводиться не за круглим барабаном, а на прямокутному полі, розбитому на квадратики.\nКожен такий квадратик містить одне число (числа можуть бути як доданими, так і від'ємними). Гравець розташовується у верхній лівій клітинці і може переміщуватись у три сусідніх клітинки: праву, нижню та праву нижню по діагоналі (див. малюнок) і повинен потрапити до правої нижньої клітинки.\nЗвісно, що Степан має бажання виграти гру і набрати якомога більше балів. Якщо набрана сума додатна, то Степан виграв, інакше програв.\nНапишіть програму, яка доможе Степану визначити програє чи виграє він у грі і яку суму він зможе набрати.\nФормат вхідних даних: Перший рядок вхідного файлу містить два цілих числа N, M (1 ≤ N ≤ 100, 1 ≤ M ≤ 100) - розміри ігрового поля.\nНаступні N рядків містять по М цілих чисел - значення клітинок ігрового поля, по модулю не більші за 1000.\nФормат вихідних даних: Перший рядок вихідного файлу має містити одне слово - winner, якщо Степан виграв гру, або loser - в іншому випадку.\nДругий рядок має містити одне число - набрану суму.", "compiler": "Judge C++", "send_date": "30 янв. 2017 г., 17:09:00", "time": 3.25, "memory": 676, "code": "#include <bits/stdc++.h>\nusing namespace std;\nint main()\n{\n    ios_base::sync_with_stdio(0);\n    cin.tie(0);\n    cout.tie(0);\n\n    int n,m;\n    cin >> n >> m;\n    int i,j;\n    int a[n+1][m+1];\n    int sum1 = 0, sum2 = 0;\n    int d[n+1][m+1];\n    for(i = 0 ; i < n;i++)\n        for(j=0;j<m;j++)\n            cin >> a[i][j];\n     for(i = 0; i < n;i++)\n     {\n         sum1 += a[i][0];\n         d[i][0] = sum1;\n     }\n     for(j=0;j<m;j++)\n     {\n         sum2 += a[0][j];\n         d[0][j] = sum2;\n     }\n     i = 1;\n     j = 1;\n     for(i=1;i<n;i++)\n     {\n         for(j=1;j<m;j++)\n         {\n             d[i][j] = max(d[i-1][j],max(d[i][j-1],d[i-1][j-1])) + a[i][j];\n         }\n     }\n     if(d[n-1][m-1] > 0)\n     {\n         cout << \"winner\" << endl;\n         cout << d[n-1][m-1] << endl;\n     }\n     else\n     {\n          cout << \"loser\" << endl;\n         cout << d[n-1][m-1] << endl;\n     }\n\n\n}", "link": "https://www.e-olymp.com/ru/problems/7235"}