{"name": "Армия магов", "text": "Армия магов\nНа собрании стояла довлеющая тишина. Стало окончательно ясно, что после битвы на Севере все члены великого войска Коалиции закончат карьеру боевых магов и займут руководящие должности Наставников. А значит, нужно срочно набирать новую боеспособную армию. Лишь мудрый Сандро нарушал тишину скрипом пера о бумагу - он выписывал имена достойных по его мнению кандидатов. Наконец, он закончил. На листке были написаны 5n имён. Но суровые законы предписывали выбрать лишь n достойнейших магов. После долгих споров, было решено создать армию, в которой каждая пара магов уважала бы друг друга.\nКак известно, в королевстве все маги живут в отдельных домах, расположенных в точках плоскости с целыми координатами. Так получилось, что маги уважают друг друга в том и только в том случае, если на отрезке, соединяющем их дома, лежит хотя бы одна точка с целыми координатами, отличная от концов отрезка. Например, если дома расположены в точках (1, 1) и (5, 5), то эти маги уважают друг друга, так как между их домами есть точка (2, 2). А вот жильцы домов с координатами (0, 0) и (1, 10), увы, не относятся друг к другу с уважением. Помогите правительству королевства собрать армию!\nВходные данные\nВ первой строке записано целое число n (1 ≤ n ≤ 5000). В i-ой из следующих 5n строк записана пара целых чисел x и y, по модулю не превосходящих 10000 - координаты дома i-го кандидата в армию. Все дома расположены в различных точках.\nВыходные данные\nЕсли искомая армия существует, в первой строке выведите \"OK\", а во второй строке запишите через пробел в произвольном порядке n чисел - номера выбранных кандидатов. Если возможных ответов несколько, выведите любой. Если армию создать нельзя, выведите \"IMPOSSIBLE\".", "compiler": "Judge C++", "send_date": "20 июн. 2017 г., 16:01:05", "time": 19.47, "memory": 1808, "code": "#include <bits/stdc++.h>\n#include <string>\nusing namespace std;\nstruct S{\n    int x,y, number;\n};\nint main(){\n    int n, x,y;\n    cin >> n;\n    vector <S> a;\n    vector <S> b;\n    vector <S> c;\n    vector <S> d;\n    for(int i = 0; i < 5*n;i++){\n        S t;\n        cin >> x >> y;\n        t.x = x;\n        t.y = y;\n        t.number = i+1;\n        if(abs(x%2) == 0 && abs(y%2)==0)\n            a.push_back(t);\n        if(abs(x%2) == 0 && abs(y%2) == 1)\n            b.push_back(t);\n        if(abs(x%2) == 1 && abs(y%2)==0)\n            c.push_back(t);\n        if(abs(x%2) == 1 && abs(y%2) == 1)\n            d.push_back(t);\n    }\n    if(a.size() >= n)\n    {\n        cout << \"OK\" << endl;\n        for(int i = 0; i < n; i++)\n            cout << a[i].number << \" \";\n        return 0;\n    }\n    if(b.size() >= n)\n    {\n        cout << \"OK\" << endl;\n        for(int i = 0; i < n; i++)\n            cout << b[i].number << \" \";\n        return 0;\n    }\n    if(c.size() >= n)\n    {\n        cout << \"OK\" << endl;\n        for(int i = 0; i < n; i++)\n            cout << c[i].number << \" \";\n        return 0;\n    }\n    if(d.size() >= n)\n    {\n        cout << \"OK\" << endl;\n        for(int i = 0; i < n; i++)\n            cout << d[i].number << \" \";\n        return 0;\n    }\n}", "link": "https://www.e-olymp.com/ru/problems/4340"}