{"name": "Ребус", "text": "Ребус\nНа прошлом уроке английского Пете задали домашнее задание. Оно заключалось в разгадывании ребусов. Каждый ребус — это последовательность картинок. С двух сторон от каждой картинки могут располагаться апострофы. Каждая картинка обозначает некоторое слово. Предположим, что перед некоторой картинкой нарисовано i апострофов, а после нее j апострофов. Это значит, что у слова, которое сопоставляется картинке, необходимо убрать i букв с начала и j с конца, а оставшуюся его часть записать вместо картинки и апострофов. Так необходимо сделать с каждой картинкой и окружающими ее апострофами. После этого нужно \"склеить\" получившиеся кусочки в одно слово. Оно и будет разгадкой ребуса.\nУ Пети нет проблем с тем, чтобы сопоставить каждой картинке слово. Но ему очень лень заниматься отбрасыванием лишних букв и склеиванием слов. Поэтому он попросил вас помочь ему. Дана строка, которая состоит из маленьких латинских букв, апострофов (символов с кодом 39), а также пробелов, которые разделяют слова. Апостроф относиться к некоторому слову, если между ними нет пробела. Если апостроф стоит слева от слова, то у него необходимо убрать одну букву с начала, если справа — с конца. Потом необходимо склеить все слова в одно.\nНапример, пусть дана строчка \"team ' ''' school '' olympiad'''\". В первом слове ничего изменять не надо, так как к нему не относится ни один апостроф. Во втором необходимо убрать первые четыре буквы и получить \"ol\", из третьего слова получится \"ymp\". После склеивания трех кусочков получим строку \"teamolymp\".\nВходные данные\nВ первой строке входного файла дан ребус, длиной не более 100 символов, который необходимо решить. Гарантируется, что в строчке присутствуют только апострофы (код символа — 39), пробелы и маленькие латинские буквы, а также, что ребус корректен — нет слова, у которого необходимо удалить букв больше, чем его длина.\nВыходные данные\nВыведите одно слово — ответ на ребус.\nПримечание: Для большей наглядности тестовый пример приведён также и на картинке, причём картинка ближе к действительности.", "compiler": "Judge C++", "send_date": "8 окт. 2016 г., 16:27:18", "time": 4.18, "memory": 676, "code": "#include <string>\n#include <iostream>\nusing namespace std;\nstring s;\nstring g = \"\";\nint j,c1=0,c2=0;\nint main()\n{\n    ios_base::sync_with_stdio(0);\n    while(cin >> s)\n    {\n        c1 = 0;\n        c2 = 0;\n        for(j=0;j<s.length();j++)\n            if(s[j]==(char)39)\n                c1++;\n            else\n                break;\n        for(j=s.length()-1;j>=0;j--)\n        if(s[j] == (char)39)\n            c2++;\n        else\n            break;\n            if(c1==0&&c2==0)\n            {\n                g+=s;\n                continue;\n            }\n        for(j=c1*2;j<(s.length()-c2*2);j++)\n        g+=s[j];\n\n    }cout << g << endl;\n}", "link": "https://www.e-olymp.com/ru/problems/3908"}