{"name": "Сортировка по росту", "text": "Сортировка по росту\nНа торжественном открытии олимпиады, впрочем, как и на её закрытии, спортсмены каждой страны были одеты в одинаковые олимпийские костюмы. Естественно, что при таком большом количестве спортсменов, тренеров и обслуживающего персонала, для многих стран сам процесс пошивки олимпийской парадной формы был довольно ответственным и важным делом, и поэтому необходимо было знать рост каждого члена делегации для пошивки формы соответствующего размера. Фирмам, которые будут заниматься пошивом парадной формы, частично повезло, так как известно, что ни в одной делегации не было членов делегации ростом ниже полутора метров и выше двух с половиной.\nУ вас в распоряжении имеется база данных, в которую занесены рост каждого члена делегации по соответствующему виду спорта. Ваша задача быстро отвечать на запросы типа: А сколько членов делегации имеют рост в пределах от a до b сантиметров?\nВходные данные\nПервая строка каждого запроса содержит единственное число n (1 ≤ n ≤ 20000) - количество членов соответствующей делегации. Во второй строке запроса содержится n целых чисел, разделённых единичным пробелом - рост соответствующего члена делегации в сантиметрах. Данные о росте не отсортированы, так как помещались в базу данных в последний момент и не были поэтому обработаны. Третья строка запроса содержит собственно сам запрос: 2 числа - нижняя и верхняя границы интересующего фирму - изготовитель ростового интервала.\nВыходные данные\nДля каждого запроса в отдельной строке выведите ответ на него.", "compiler": "Judge C++", "send_date": "11 нояб. 2017 г., 18:04:58", "time": 709.78, "memory": 1804, "code": "#include <bits/stdc++.h>\nusing namespace std;\n#define int long long\nmain() {\n    ios_base::sync_with_stdio(0);\n    ios::sync_with_stdio(0);\n    cin.tie(0);\n    cout.tie(0);\n    freopen(\"input.txt\", \"r\", stdin);\n    freopen(\"output.txt\", \"w\", stdout);\n    int n, a, b;\n    while(cin >> n){\n        vector <int> mas(n);\n        for(int i = 0; i < n; i++) cin >> mas[i];\n        cin >> a >> b;\n        int c = 0;\n        for(int i = 0; i < n; i++)\n            if(mas[i] >= a && mas[i] <= b)\n                c++;\n        cout << c << endl;\n    }\n}", "link": "https://www.e-olymp.com/ru/problems/3607"}