{"name": "Ярый коллекционер бабочек", "text": "Ярый коллекционер бабочек\nКак известно, Андрй Сергеевич - ярый коллекционер бабочек. Он имеет огромную коллекцию, экспонаты которой собраны со всего мира. Будем считать, что в мире существует 2000000000 видов бабочек.\nЧтобы не запутаться, Андрей Сергеевич присвоил каждому виду уникальный номер. Нумерация бабочек всегда начинается с единицы. Теперь он хочет знать, есть ли бабочка с видом k в его коллекции, или же её придётся добывать, затрачивая уйму сил и денег.\nВходные данные\nВ первой строке содержится количество видов бабочек n (1 ≤ n ≤ 100000) в коллекции Андрея Сергеевича. В следующей строке находятся n упорядоченных по возрастанию чисел - номера видов бабочек в коллекции. Все виды бабочек в коллекции имеют различные номера.\nВ третьей строке записано количество видов бабочек m (1 ≤ m ≤ 100000), про которых Андрей Сергеевич хочет узнать, есть ли они у него в коллекции или же нет. В последней строке содержатся m чисел - номера видов бабочек, наличие которых необходимо проверить.\nВыходные данные\nВыведите m строк. Для каждого запроса выведите \"YES\", если бабочка с данным номером содержится в коллекции, и \"NO\" в противном случае.", "compiler": "Judge C++", "send_date": "14 мар. 2017 г., 13:41:03", "time": 152.08, "memory": 3416, "code": "#include <bits/stdc++.h>\nusing namespace std;\nlong long n, m;\nbool k = false;\nvector <long long> a,b;\nvector <bool> d;\nlong long i,j;\nint main()\n{\n    ios_base::sync_with_stdio(0);\n    cin >> n;\n    for(i=0;i<n;i++)\n    {\n        d.push_back(false);\n        cin >> j;\n        a.push_back(j);\n    }\n    j=0;\n    cin >> m;\n    for(i=0;i<m;i++)\n    {\n\n        cin >> j;\n        b.push_back(j);\n    }\n    j = 0;\n    sort(a.begin(),a.end());\n    for(i=0;i<m;i++)\n    {\n        if(binary_search(a.begin(),a.end(),b[i]))\n            cout << \"YES\" << endl;\n        else\n            cout << \"NO\" << endl;\n    }\n}", "link": "https://www.e-olymp.com/ru/problems/3966"}