{"name": "Кастинг", "text": "Кастинг\nВ театре работает n актеров. Известно, что среди них a высоких, b голубоглазых и с блондинов. Для главной роли в новом спектакле режиссеру требуется только один высокий голубоглазый блондин. Чтобы спланировать свое время для беседы с каждым таким артистом из труппы театра, режиссеру необходимо узнать, какое максимальное или какое минимальное количество артистов из работающих в театре подходит для этой роли.\nТребуется написать программу, которая по заданным числам n, a, b и с определяет минимальное или максимальное количество актеров, с которыми режиссер должен переговорить.\nВходные данные\nПервая строка содержит одно число, которое задает, минимальное или максимальное количество актеров необходимо найти в данном тесте. Это число может принимать следующие значения:\n1, если в данном теcте требуется определить минимальное количество актеров;\n2, если в данном тесте требуется определить максимальное количество актеров.\nВторая строка содержит четыре целых числа: n, a, b, с (1 ≤ n ≤ 10000, 0 ≤ a, b, c ≤ n).\nВыходные данные\nВывести одно число - минимальное или максимальное (в зависимости от входных данных) количество актеров, которые могут претендовать на главную роль в новом спектакле.\nПояснения к примерам\nВ первом примере, поскольку высоких актеров всего трое, то на главную роль не может подойти больше трех человек.\nВо втором примере все актеры – блондины и все, кроме одного – голубоглазые. Тогда среди трех высоких актеров найдутся хотя бы два голубоглазых (и, естественно, они будут блондинами). Следовательно, минимум два актера точно подойдут на главную роль в новом спектакле.", "compiler": "Judge C++", "send_date": "19 июн. 2017 г., 11:07:55", "time": 2.18, "memory": 1800, "code": "#include <bits/stdc++.h>\nusing namespace std;\nint main() {\n    int t,n;\n    cin >> t >> n;\n    vector <int> a(3);\n    cin >> a[0] >> a[1] >> a[2];\n    sort(a.begin(),a.end());\n    if(t == 1){\n        if(n-((n-a[2]) + (n-a[1]) + (n-a[0])) < 0)\n        cout << 0 << endl;\n        else\n        cout << n-((n-a[2]) + (n-a[1]) + (n-a[0])) << endl;\n\n    }\n    else\n        cout << a[0] << endl;\n}", "link": "https://www.e-olymp.com/ru/problems/4212"}