{"name": "Скидки", "text": "Скидки\nПосетив перед Новым годом большой магазин, вы выбрали много подарков родным и друзьям. Сэкономить определенное количество денег вам могут помочь два типа предновогодних скидок, которые действуют в магазине:\nПри покупке трех товаров вы платите за них как за два самых дорогих из них.\nПри покупке четырех товаров вы платите за них как за три самых дорогих из них.\nТаким образом, определенные товары можно объединить в тройки либо четверки и заплатить за них меньше. Требуется определить наименьшую возможную сумму денег, которая будет потрачена на приобретение всех подарков. Например, если цены пяти выбранных подарков составляют: 50, 80, 50, 100, 20, то можно отдельно купить четыре первых товара, получить за них скидку, и потом купить оставшийся подарок по его номинальной цене. В целом вся покупка будет стоить 250 денежных единиц, вместо 300.\nНапишите программу, которая по ценам всех подарков, находит минимальную сумму денег, достаточную для их покупки.\nВходные данные\nПервая строка содержит одно целое число N (0 ≤ N ≤ 10 000). Вторая строка содержит N натуральных чисел - цены подарков. Сумма цен всех подарков меньше чем 109. Объединять можно не только те товары, которые идут подряд во входных данных.\nВыходные данные\nВывести одно целое число - найденную минимальную сумму денег, за которую можно купить все подарки.", "compiler": "Judge C++", "send_date": "23 авг. 2016 г., 19:30:41", "time": 6.0, "memory": 692, "code": "#include <bits/stdc++.h>\nusing namespace std;\nint main()\n{\n    long long n;\n    cin >> n;\n    if(n==0)\n    {\n        cout << 0 << endl;\n        exit(0);\n    }\n    long long a[n+1];\n    long long i,j;\n    long long d[n+1];\n    d[0]=0;\n    for(i=0;i<n;i++)\n        cin >> a[i];\n    sort(a,a+n+1);\n    d[0] = a[0];\n    d[1] = a[0] + a[1];\n\n    if(n >= 2)\n    {\n    d[2] = a[2]+a[1];\n    for(i=3;i<n;i++)\n    {\n        d[i] = min(d[i-3] + a[i] + a[i-1],d[i-4] + a[i]+a[i-1]+a[i-2]);\n    }\n    }\n    cout << d[n-1] << endl;\n\n}", "link": "https://www.e-olymp.com/ru/problems/80"}