{"name": "Реклама на заборе", "text": "Реклама на заборе\nИван живет в небольшом симпатичном домике в деревне. Вдоль его участка расположен забор, который недавно был выкрашен в красный цвет. Но тут в деревню к Ивану пришла цивилизация в лице рекламного агента, расклеивающего всюду свои объявления. И его забор постигла та же участь.\nКаждый день на его забор приклеивают новое объявление. Таким образом за последние n дней на забор наклеено уже n объявлений и Ивану кажется, что рекламой заклеен уже весь забор, состоящий из m досок. Доски пронумерованы вдоль забора от 1 до m.\nОказалось, что в каждый из n дней когда приходил рекламный агент и приклеивал объявление, сосед Ивана Петр записывал, какие доски оказывались заклеены этим объявлением. А именно, выяснилось что в i-й день очередное объявление было наклеено таким образом, что занимало доски с li-й по ri-ю включительно. При этом рекламный агент вполне мог заклеить новым объявлением полностью или частично свое же собственное объявление.\nДля составления жалобы в администрацию деревни Ивану необходимо удостовериться, что рекламой заклеен весь забор. Помогите ему выяснить, так ли это.\nВходные данные\nВ первой строке входного файла даны два натуральных числа m и n — число досок в заборе и число дней, в течение которых вел свои наблюдения Петр (1 ≤ m ≤ 10000, 1 ≤ n ≤ 1000). Далее, в n строках заданы целые числа li, ri (1≤li≤ri≤m), i-я пара чисел описывает отрезок забора, который заклеивались объявлением в i-й день.\nВыходные данные\nВыведите \"YES\", если весь забор был заклеен объявлениями, и \"NO\" в противном случае.", "compiler": "Judge C++", "send_date": "8 окт. 2016 г., 21:36:04", "time": 9.96, "memory": 676, "code": "#include <bits/stdc++.h>\nusing namespace std;\nstruct S\n{\n    int a,b;\n};\nint m, n, i, j;\nint main()\n{\n    ios_base::sync_with_stdio(0);\n    cin >> m >> n;\n    vector <S> d(n);\n    vector <int> f(m,0);\n    vector <int> u(m,1);\n    for(i=0;i<n;i++)\n    {\n        cin >> d[i].a >> d[i].b;\n        for(j=d[i].a-1;j<d[i].b;j++)\n        {\n            f[j]=1;\n        }\n    }\n    if(f == u)\n        cout << \"YES\" << endl;\n    else\n        cout << \"NO\" << endl;\n    return 0;\n}", "link": "https://www.e-olymp.com/ru/problems/3902"}