{"name": "\"Все, Степан! Ти мене дістав!\"", "text": "\"Все, Степан! Ти мене дістав!\"\nСтепан нещодавно відпочивав у Японії і привіз звідти нову жувальну гумку. На першій парі в університеті він поділився гумкою зі своїм товаришем. Дочекавшись моменту, коли лектор повернувся до дошки, на рахунок \"три - чотири\" хлопці дружньо почали надувати бульбашки. Відомо, що Степан надуває бульбашку до максимально можливого розміру за час t1, після чого бульбашка миттєво лопається, і Степан починає надувати бульбашку заново з тією ж швидкістю. Товариш Степана робе те ж саме за час t2.\nВесь цей час викладач настільки захоплений доведенням теореми, що взагалі нічого не чує. І тільки коли обидві бульбашки лопнуть одночасно, викладач почує шум і обернеться. І тоді вже точно студентам попаде на горіхи, а більше усього тому, хто приніс на пару жувальні гумки.\nВизначте, скільки часу хлопці можуть насолоджуватись надуванням бульбашок, не замічені викладачем.\nНаприклад, якщо t1 = 2, t2 = 3, то буде відбуватись наступне:\nСтепан надуває бульбашку з моменту часу t = 0 до моменту часу t = 2, потім бульбашка лопається, і він надуває бульбашку заново - з моменту часу t = 2 до моменту часу t = 4, а потім ще раз - з моменту часу t = 4 до t = 6.\nТовариш Степана надуває бульбашку з t = 0 до t = 3 і ще раз з t = 3 до t = 6.\nВ момент часу t = 6 бульбашки лопаються одночасно в обох студентів, викладач повертається і каже: \"Все, Степан! Ти мене дістав!\".\nФормат вхідних даних: Перший рядок вхідного файлу містить два цілих числа t1, t2 (1 ≤ t1, t2 ≤ 109).\nФормат вихідних даних: Вихідний файл повинен містити одне ціле число - час, протягом якого Степан з товаришем можуть насолоджуватись надуванням бульбашок.", "compiler": "Judge C++", "send_date": "30 янв. 2017 г., 23:32:16", "time": 3.79, "memory": 676, "code": "#include <bits/stdc++.h>\nusing namespace std;\nlong long gcd(long long a, long long b)\n{\n     while(true)\n    {\n        a%=b;\n        if(a==0)\n            return b;\n        b%=a;\n        if(b==0)\n            return a;\n    }\n}\nint main()\n{\n    ios_base::sync_with_stdio(0);\n    cin.tie(0);\n    cout.tie(0);\n\n    long long t1,t2;\n    cin >> t1 >> t2;\n    long long a,b;\n    a = t1;\n    b = t2;\n\n    cout << (a*b)/gcd(a,b) << endl;\n\n}", "link": "https://www.e-olymp.com/ru/problems/7239"}