{"name": "Санта Клаус", "text": "Санта Клаус\nСанта Клаус готовится к Рождеству. В этот праздник он хочет вручить подарки n детям. Его помощники Эльфы уже собрали два мешка, с которыми он отправится в новогоднее путешествие по всем странам мира. И чтобы Санта не запутался, Эльфы составили список детей, чьи подарки уже лежат в каждом из мешков. Санта хочет помочь Эльфам, и поэтому решил положить в третий мешок подарки для тех детей, которым они еще не подготовлены.\nПомогите Санте, составьте список детей, чьи подарки надо положить в третий мешок.\nВходные данные\nПервая строка входного файла содержит три целых числа: n — число детей, m и k — число подарков в первом и втором мешке соответственно (1 ≤ n, m, k ≤ 100; m+k ≤ n). Вторая строка входного файла содержит m целых чисел — номера детей, подарки для которых лежат в первом мешке. Третья строка входного файла содержит k целых чисел — номера детей, подарки для которых лежат во втором мешке.\nГарантируется что Эльфы положили для каждого ребенка не более одного подарка. Номера всех детей являются целыми положительными числами не превосходящими n. Все дети должны получить подарок на Рождество, иначе Санта расстроится.\nВыходные данные\nВ первой строке выведите одно число a — сколько подарков должно быть в третьем мешке. Во второй строке выведите в произвольном порядке a чисел — номера детей, которым эти подарки должны быть доставлены.", "compiler": "Judge C++", "send_date": "16 дек. 2016 г., 15:29:22", "time": 3.43, "memory": 676, "code": "#include <bits/stdc++.h>\nusing namespace std;\nint main()\n{\n    freopen(\"input.txt\",\"r\",stdin);\n    freopen(\"output.txt\",\"w\",stdout);\n    int n, m,k;\n    cin >> n >> m >> k;\n    vector <int> d(m);\n    queue <int> q;\n    vector<int> g(k);\n    vector <int> t(n);\n    int i,c=0,j;\n    for(i=0;i<m;i++){\n        cin >> d[i];\n    t[d[i]-1] = 1;\n    }\n    for(j=0;j<k;j++){\n        cin >> g[j];\n        t[g[j]-1] = 1;\n    }\n    for(i=0;i<n;i++){\n        if(t[i]==0){\n            c++;\n            q.push(i+1);\n        }\n    }\n    cout << c << endl;\n    k = q.size();\n    for(i=0;i<k;i++)\n    {\n        cout << q.front() << \" \";\n        q.pop();\n    }\n    cout << endl;\n\n}", "link": "https://www.e-olymp.com/ru/problems/1494"}