{"name": "Муха Фон-Неймана", "text": "Муха Фон-Неймана\nСледующая задача была предложена Джону Фон-Нейману:\nДва велосипедиста a и b начинают поездку навстречу друг другу в одно и то же время с мест, находящихся на расстоянии 250 друг от друга, a движется со скоростью 10 миль в час, b движется со скоростью 15 миль в час. В это же время муха взлетает с колеса велосипедиста a и движется навстречу к b, затем разворачивается и летит обратно. Пока велосипедисты приближаются друг к другу, муха продолжает летать между ними, касаясь каждый раз переднего колеса велосипедистов, пока, наконец, не будет раздавлена колесами встретившихся велосипедов. Так как муха летает быстрее каждого из велосипедистов, она совершает бесконечное количество полетов, при этом пройдя конечное расстояние (бесконечный ряд сходится). Какое расстояние пролетела муха?\nФон-Нейман немедленно вычислил бесконечный ряд (в уме!), и получил верный ответ: 200 миль.\nВам следует написать программу, которая решает более общую задачу, с различными начальными расстояниями и скоростями.\nВходные данные\nПервая строка содержит количество тестов p (1 ≤ p ≤ 1000).\nКаждый тест состоит из одной строки, содержащей пять чисел: номер теста n и четыре действительных числа: начальное расстояние между велосипедистами d (10 ≤ d ≤ 1000), скорость первого велосипедиста a (1 ≤ a ≤ 30) в милях в час, скорость второго велосипедиста b (1 ≤ b ≤ 30) в милях в час и скорость мухи f (a ≤ b < f ≤ 50) в милях в час.\nВыходные данные\nДля каждого теста вывести в отдельной строке номер теста, пробел, и количество миль, которое пролетела муха (бесконечная сумма расстояний, описанных в условии) с точностью до двух десятичных знаков.", "compiler": "Judge C++", "send_date": "15 янв. 2017 г., 19:37:37", "time": 2.31, "memory": 672, "code": "#include <bits/stdc++.h>\nusing namespace std;\nint main()\n{\n    int n;\n    cin >> n;\n    double d,a,b,f,o;\n    double v,p;\n    while(n--)\n    {\n        cin >> o >> d >> a >> b >> f;\n        v = (a+b)/2;\n        p = ((d/v)*f)/2;\n        cout << o << \" \" <<  setprecision(2) << fixed <<  p << endl;\n    }\n}", "link": "https://www.e-olymp.com/ru/problems/6388"}